benchmarks/cylinder/bodyFitted/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| Flow around a cylinder — body-fitted, laminar. With the x10 mesh scale        |
| (D=0.2) this is Re = U*D/nu = 1*0.2/0.01 = 20, matching the blockAMR case.     |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

nu              1e-2;

// ************************************************************************* //
