benchmarks/cylinder/bodyFitted/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| Fixed-step benchmark control. endTime / deltaT are rewritten by the harness  |
| (benchmarks/test_cylinder_runtime.py) so every solver does the same number   |
| of steps; adjustTimeStep is off so the work is deterministic.                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     incompressibleFluid;

startFrom       startTime;
startTime       0;
stopAt          endTime;

// 20 fixed steps at CFL ~= 0.3 for the freestream cell size (~3.75e-4 m, U=1).
endTime         0.002;
deltaT          0.0001;

writeControl    timeStep;
writeInterval   10000;
purgeWrite      0;

writeFormat     ascii;
writePrecision  6;
timeFormat      general;
timePrecision   6;

runTimeModifiable no;
adjustTimeStep  no;

// ************************************************************************* //
